Repository: ministryofjustice/money-to-prisoners-send-money
Catalog: mtp_send_money/translations/*/LC_MESSAGES/django.po
Languages: cy

source: Enter questions or feedback about this service
cy: Nodwch unrhyw gwestiynau neu adborth sydd gennych am y gwasanaeth hwn

source: Don’t include bank details or other personal information
cy: Peidiwch â chynnwys manylion banc nac unrhyw wybodaeth bersonol arall

source: Prisoner number
cy: Rhif y carcharor

source: For example, A1234BC
cy: Er enghraifft, A1234BC

source: Prisoner date of birth
cy: Dyddiad geni y carcharor

source: For example, 28/04/1996
cy: Er enghraifft, 28/04/1996

source: Enter your email address if you’d like a reply
cy: Nodwch eich cyfeiriad e-bost os hoffech i ni eich ateb

source: We won’t use it for anything else
cy: Ni fyddwn yn ei ddefnyddio ar gyfer unrhyw beth arall

source: Terms and conditions
cy: Telerau ac amodau

source: Cookies
cy: Cwcis

source: Feedback
cy: Adborth

source: Please choose how you want to send money
cy: Dewiswch sut yr ydych chi eisiau anfon arian

source: For example, 28 04 1996
cy: Er enghraifft, 28 04 1996

source: This service is currently unavailable
cy: Nid yw'r gwasanaeth hwn ar gael ar hyn o bryd

source: No prisoner matches the details you’ve supplied.
cy: Nid oes carcharor sy'n cyfateb i'r manylion a roddwyd gennych.

source: Prisoner name
cy: Enw'r carcharor

source: The amount you are trying to send is too large.
cy: Mae'r swm yr ydych chi'n ceisio ei anfon yn rhy fawr.

source: Please enter a smaller amount
cy: Nodwch swm llai

source: Amount
cy: Swm

source: Enter as a number
cy: Nodwch ef fel rhif

source: Amount should be 1p or more
cy: Dylai'r swm fod yn 1c neu fwy

source: Only use 2 decimal places
cy: Defnyddiwch 2 bwynt degol yn unig

source: Your email address
cy: Eich cyfeiriad e-bost

source: Could not connect to service, please try again later
cy: Nid oedd yn bosib cysylltu â'r gwasanaeth, rhowch gynnig arall arni hwyrach ymlaen

source: Pay now by debit card
cy: Talu nawr gyda cherdyn debyd

source: Get a prisoner reference to use in a UK bank transfer
cy: Creu cyfeirnod carcharor i'w ddefnyddio wrth wneud trosglwyddiad banc DU

source: Her Majesty’s Prison and Young Offender Institution
cy: Carchar Ei Mawrhydi a Sefydliad Troseddwyr Ifanc

source: Her Majesty’s Prison
cy: Carchar Ei Mawrhydi

source: Her Majesty’s Young Offender Institution and Remand Centre
cy: Sefydliad Troseddwyr Ifanc Ei Mawrhydi a Chanolfan Remand

source: Her Majesty’s Young Offender Institution
cy: Sefydliad Troseddwyr Ifanc Ei Mawrhydi

source: Immigration Removal Centre
cy: Canolfan Symud Mewnfudwyr

source: Secure Training Centre
cy: Canolfan Hyfforddi Ddiogel

source: Send money to a prisoner: your payment was successful
cy: Anfon arian at garcharor: roedd eich taliad yn llwyddiannus

source: Incorrect prisoner number format
cy: Fformat anghywir i'r rhif carcharor

source: Please do not enter your debit card number here
cy: Peidiwch â nodi rhif eich cerdyn debyd yma

source: Send money to a prisoner: Your prisoner reference is %(bank_transfer_reference)s
cy: Anfon arian at garcharor: Eich cyfeirnod carcharor yw %(bank_transfer_reference)s

source: Not known
cy: Anhysbys

source: To this prisoner: %(prisoner_number)s
cy: At y carcharor hwn: %(prisoner_number)s

source: Send money to a prisoner
cy: Anfon arian at garcharor

source: This is a new service.
cy: Mae hwn yn wasanaeth newydd.

source: <a href="%(ticket_url)s">Contact us</a> if you need help.
cy: <a href="%(ticket_url)s">Cysylltwch â ni</a>os ydych angen cymorth.

source: Built by
cy: Cynhyrchwyd gan

source: Ministry of Justice
cy: Y Weinyddiaeth Cyfiawnder

source: GOV.UK puts small files (known as ‘cookies’) onto your computer to collect information about how you browse the site.
cy: Mae GOV.UK yn rhoi ffeiliau bach (o’r enw ‘cwcis’) ar eich cyfrifiadur i gasglu gwybodaeth am sut yr ydych chi’n pori'r wefan.

source: Cookies are used to:
cy: Fe ddefnyddir cwcis i:

source: measure how you use the website so it can be updated and improved based on your needs
cy: asesu sut yr ydych chi’n defnyddio’r wefan er mwyn ei diweddaru a’i gwella ar sail eich anghenion

source: remember the notifications you’ve seen so that we don’t show them to you again
cy: cofio’r negeseuon yr ydych chi wedi’u gweld fel na fyddwn ni’n eu dangos i chi eto

source: GOV.UK cookies aren’t used to identify you personally.
cy: Ni ddefnyddir cwcis GOV.UK i’ch adnabod yn bersonol.

source: You’ll normally see a message on the site before we store a cookie on your computer.
cy: Fel arfer, byddwch chi’n gweld neges ar y wefan cyn i ni storio cwci ar eich cyfrifiadur.

source: Find out more about <a href="http://www.aboutcookies.org/" rel="external">how to manage cookies</a>.
cy: Darganfod mwy am <a href="http://www.aboutcookies.org/" rel="external">sut i reoli cwcis</a>.

source: How cookies are used on GOV.UK
cy: Sut mae cwcis yn cael eu defnyddio ar GOV.UK

source: Measuring website usage (Google Analytics)
cy: Mesur defnydd o’r wefan (Google Analytics)

source: We use Google Analytics software to collect information about how you use GOV.UK. We do this to help make sure the site is meeting the needs of its users and to help us make improvements.
cy: Rydym yn defnyddio meddalwedd Google Analytics i gasglu gwybodaeth am sut yr ydych chi’n defnyddio GOV.UK. Rydym yn gwneud hyn er mwyn ceisio sicrhau bod y wefan yn cwrdd ag anghenion ei defnyddwyr ac i’n helpu i’w gwella.

source: Google Analytics stores information about:
cy: Mae Google Analytics yn storio gwybodaeth am:

source: the pages you visit on GOV.UK - how long you spend on each GOV.UK page
cy: y tudalennau yr ydych chi’n ymweld â nhw ar GOV.UK - faint o amser rydych yn ei dreulio ar bob tudalen ar GOV.UK

source: how you got to the site
cy: sut wnaethoch chi gyrraedd y wefan

source: what you click on while you’re visiting the site.
cy: ar beth fyddwch chi’n clicio wrth ymweld â’r wefan.

source: We don’t collect or store your personal information so this information can’t be used to identify who you are. For more information visit our <a href="%(terms_url)s">Terms and conditions and privacy policy</a> page.
cy: Nid ydym yn casglu nac yn storio’ch gwybodaeth bersonol, felly ni ellir defnyddio’r wybodaeth hon i’ch adnabod. Mae yna fwy o wybodaeth ar ein tudalen <a href="%(terms_url)s">Telerau ac amodau a pholisi preifatrwydd</a>.

source: We don’t allow Google to use or share our analytics data.
cy: Nid ydym yn caniatáu i Google ddefnyddio na rhannu ein data dadansoddi.

source: Google Analytics sets the following cookies:
cy: Mae Google Analytics yn gosod y cwcis canlynol:

source: Name
cy: Enw

source: Purpose
cy: Pwrpas

source: Expires
cy: Dod i ben

source: and
cy: a/ac

source: This is a google analytics cookie that helps us understand how the service is being used in detail. Your data is anonymised.
cy: Mae’r cwci Google Analytics hwn yn ein helpu i weld yn fanwl sut y mae’r gwasanaeth yn cael ei ddefnyddio. Bydd eich data yn ddienw.

source: 2 years
cy: 2 flynedd

source: You can <a href="https://tools.google.com/dlpage/gaoptout" rel="external">opt out of Google Analytics cookies</a>.
cy: Gallwch <a href="https://tools.google.com/dlpage/gaoptout" rel="external">ddewis peidio â derbyn cwcis Google Analytics</a>.

source: Our introductory message
cy: Ein neges ragarweiniol

source: You may see a pop-up welcome message when you first visit GOV.UK.
cy: Mae’n bosibl y byddwch chi’n gweld neges naid fydd yn eich croesawu i wefan GOV.UK wrth ei defnyddio am y tro cyntaf.

source: We’ll store a cookie so that your computer knows you’ve seen it and knows not to show it again.
cy: Byddwn yn storio cwci fel y bydd eich cyfrifiadur yn gwybod eich bod wedi’i gweld ac i beidio â’i dangos eto.

source: Saves a message to let us know that you have seen our cookie message
cy: Mae’n cadw neges i roi gwybod i ni eich bod wedi gweld ein neges am gwcis

source: 1 month
cy: 1 mis

source: Your progress when using the service
cy: Eich cynnydd pan fyddwch yn defnyddio'r gwasanaeth

source: When you use the “Send money to a prisoner” service, we’ll set a cookie to remember your progress through the forms.
cy: Pan fyddwch chi’n defnyddio’r gwasanaeth "Anfon arian at garcharor", byddwn yn gosod cwci ar eich cyfrifiadur i gofio sut yr ydych chi’n symud ymlaen drwy’r ffurflenni.

source: These cookies don’t store your personal data and are deleted once you’ve completed the transaction.
cy: Ni fydd y cwcis hyn yn storio’ch data personol a byddant yn cael eu dileu ar ôl i chi gwblhau’r broses.

source: An identifier for your session
cy: Mae’n cofio sut yr ydych chi wedi symud ymlaen yn ystod y sesiwn

source: At the end of the session
cy: Ar ddiwedd y sesiwn

source: You can read more about <a href="https://www.gov.uk/help/cookies" rel="external">how cookies are used on gov.uk</a>.
cy: Mae yna ragor o wybodaeth am <a href="https://www.gov.uk/help/cookies" rel="external">sut mae cwcis yn cael eu defnyddio ar gov.uk</a>.

source: Enter prisoner details
cy: Nodwch fanylion y carcharor

source: To make a bank transfer online, you need a prisoner reference number.
cy: I wneud trosglwyddiad banc ar-lein, rydych angen cyfeirnod carcharor.

source: To provide this, we need these details:
cy: I ddarparu hyn, rydym angen y manylion canlynol:

source: Prisoner details
cy: Manylion y carcharor

source: Get reference
cy: Creu cyfeirnod

source: Now you can make the bank transfer
cy: Gallwch nawr wneud y trosglwyddiad banc

source: Your prisoner reference:
cy: Eich cyfeirnod carcharor:

source: Use this reference to make your bank transfer
cy: Defnyddiwch y cyfeirnod hwn i wneud eich trosglwyddiad banc

source: Print this page
cy: Argraffu'r dudalen hon

source: Email me this page
cy: Anfon y dudalen hon ataf drwy e-bost

source: Send me an email
cy: Anfon e-bost ataf

source: Log into your online banking account, mobile banking app or use your telephone banking, as normal.
cy: Mewngofnodwch i'ch cyfrif bancio ar-lein, ap bancio symudol neu defnyddiwch eich gwasanaeth bancio dros y ffôn, yn unol â’r drefn arferol.

source: Copy and paste these details into the transfer:
cy: Copïwch a gludwch y manylion hyn yn y trosglwyddiad:

source: Account number:
cy: Rhif y cyfrif:

source: Sort code:
cy: Cod didoli:

source: Reference:
cy: Cyfeirnod:

source: Payee/Name:
cy: Taledig/Enw:

source: All prisons share this bank account.
cy: Mae pob carchar yn rhannu'r cyfrif banc hwn.

source: Please use your prisoner reference to make sure the money goes to the right prisoner.
cy: Defnyddiwch eich cyfeirnod carcharor er mwyn sicrhau bod yr arian yn mynd i'r carcharor cywir.

source: Remember, you can’t do a bank transfer in-branch and you must use a UK bank account.
cy: Cofiwch, ni allwch wneud trosglwyddiad banc drwy fynd i'ch banc ac mae'n rhaid i chi ddefnyddio cyfrif banc DU.

source: The money should take up to 3 working days to reach the prisoner’s account.
cy: Dylai'r arian gymryd hyd at 3 diwrnod gwaith i gyrraedd cyfrif y carcharor.

source: No money is processed at weekends or bank holidays.
cy: Ni chaiff arian ei brosesu ar benwythnosau nac ar wyliau banc.

source: <a href="%(help_url)s">Find further help</a> on how to use the service or <a href="%(ticket_url)s">contact us</a>.
cy: <a href="%(help_url)s">Mwy o gymorth</a> ar sut i ddefnyddio'r gwasanaeth neu <a href="%(ticket_url)s">gysylltu â ni</a>.

source: Before you continue
cy: Cyn i chi barhau

source: Please note
cy: Dalier sylw

source: Only transfers done using online banking, your mobile banking app or telephone banking will reach the prisoner - you can’t go into a bank branch to transfer money
cy: Dim ond trosglwyddiadau a wnaed gan ddefnyddio bancio ar-lein, eich ap bancio symudol neu wasanaeth bancio dros y ffôn fydd yn cyrraedd y carcharor - ni allwch fynd i'r banc i drosglwyddo arian

source: Only transfers from a UK bank account will reach the prisoner - you can’t transfer money from an international bank account
cy: Dim ond trosglwyddiadau o gyfrif banc DU fydd yn cyrraedd y carcharor - ni allwch drosglwyddo arian o gyfrif banc rhyngwladol

source: I understand
cy: Rwy'n deall

source: Contact us
cy: Cysylltu â ni

source: Thank you for getting in touch.
cy: Diolch yn fawr i chi am gysylltu.

source: We will respond to any questions as soon as we can.
cy: Byddwn yn ymateb i unrhyw gwestiynau cyn gynted â phosibl.

source: Back
cy: Yn ôl

source: Help
cy: Cymorth

source: Your message
cy: Eich neges

source: If you’re having difficulties using the service, please send:
cy: Os ydych chi'n cael trafferth defnyddio'r gwasanaeth, anfonwch:

source: Send
cy: Anfon

source: Find help if you’ve already sent money but the:
cy: Dod o hyd i gymorth os ydych eisoes wedi anfon arian ond:

source: Bank transfer was returned
cy: Cafodd y trosglwyddiad banc ei ddychwelyd

source: Payment has taken longer than expected
cy: Mae taliad wedi cymryd mwy o amser na'r disgwyl

source: Prisoner has been moved or released
cy: Mae'r carcharor wedi cael ei symud neu ryddhau

source: Enter amount to send
cy: Nodwch y swm yr ydych eisiau anfon

source: Please enter the amount in pounds
cy: Nodwch y swm mewn punnoedd

source: Service charge:
cy: Tâl gwasanaeth:

source: The service charge is %(charge_percentage)s of the amount you’re sending, plus %(charge_fixed)s.
cy: Y tâl gwasanaeth yw %(charge_percentage)s o'r swm yr ydych yn anfon, a %(charge_fixed)s ar ben hynny.

source: This fee is charged by your card provider.
cy: Fe godir y ffi hon gan ddarparwr eich cerdyn.

source: Total to pay:
cy: Cyfanswm i'w dalu:

source: For instance, if you want to send %(sample_amount)s, you will be charged %(sample_amount_total_charge)s.
cy: Er enghraifft, os ydych eisiau anfon %(sample_amount)s, fe godir ffi o %(sample_amount_total_charge)sarnoch.

source: Check details
cy: Gwirio'r manylion

source: Date of birth
cy: Dyddiad geni

source: Change
cy: Newid

source: Name, date of birth or prisoner number
cy: Enw, dyddiad geni neu rif carcharor

source: Total to prisoner
cy: Cyfanswm i'r carcharor

source: Amount to be taken from your account
cy: Swm i'w dynnu o'ch cyfrif

source: Total
cy: Cyfanswm

source: Please be aware that you can’t request a refund once money is sent.
cy: Ni allwch ofyn am ad-daliad unwaith y bydd arian wedi'i anfon.

source: Enter card details
cy: Nodwch fanylion y cerdyn

source: Cancel and delete all details
cy: Canslo a dileu'r holl fanylion

source: Payment successful
cy: Taliad yn llwyddiannus

source: Your confirmation number is
cy: Eich rhif cadarnhau yw

source: Payment summary
cy: Crynodeb o'r taliad

source: Payment to
cy: Taliad at

source: Payment amount
cy: Swm y taliad

source: Date payment made
cy: Dyddiad gwneud y taliad

source: Confirmation number
cy: Rhif cadarnhau

source: What happens next
cy: Beth fydd yn digwydd nesaf

source: We’ll email you a copy of this confirmation page.
cy: Byddwn yn anfon copi o'r dudalen gadarnhau hon atoch ar e-bost.

source: Please check your spam folder.
cy: Edrychwch yn eich ffolder negeseuon sbam.

source: The money will arrive in the prisoner’s account in up to 3 working days.
cy: Bydd yr arian yn cyrraedd cyfrif y carcharor mewn hyd at 3 diwrnod gwaith.

source: You’ll get a further email when the prisoner’s account has been credited to confirm your money has arrived.
cy: Fe gewch e-bost arall pan fydd cyfrif y carcharor wedi cael ei gredydu i gadarnhau bod eich arian wedi cyrraedd.

source: Take a moment to rate this service
cy: Rhowch ychydig o'ch amser i raddio'r gwasanaeth hwn

source: We’re sorry, your payment could not be processed on this occasion
cy: Yn anffodus, nid oedd yn bosib prosesu eich taliad y tro hwn

source: Your reference number is <strong>%(short_payment_ref)s</strong>
cy: Eich cyfeirnod yw <strong>%(short_payment_ref)s</strong>

source: Enter amount
cy: Nodwch y swm

source: Send your bank transfer using this prisoner reference:
cy: Anfonwch eich trosglwyddiad banc gan ddefnyddio'r cyfeirnod carcharor hwn:

source: Remember:
cy: Cofiwch:

source: This is just the reference.
cy: Dim ond y cyfeirnod yw hwn.

source: You have not sent any money yet.
cy: Nid ydych wedi anfon unrhyw arian eto.

source: You need to log into your online banking account, mobile banking app or use your telephone banking, as usual.
cy: Mae angen i chi fewngofnodi i'ch cyfrif bancio ar-lein, ap bancio symudol neu ddefnyddio eich gwasanaeth bancio dros y ffôn, yn unol â’r drefn arferol.

source: <a href="%(help_url)s">Help</a> with problems using this service or how to <a href="%(feedback_url)s">contact us</a>.
cy: <a href="%(help_url)s">Cymorth</a> gyda phroblemau wrth ddefnyddio'r gwasanaeth hwn neu sut i <a href="%(feedback_url)s">gysylltu â ni</a>.

source: Book a social visit with a prisoner online using the <a href="https://www.gov.uk/prison-visits">Visit someone in prison</a> service.
cy: Trefnu ymweliad cymdeithasol gyda charcharor ar-lein gan ddefnyddio'r <a href="https://www.gov.uk/prison-visits">gwasanaeth</a> Ymweld â rhywun yn y carchar.

source: It’s the faster and simpler way to plan to see friends and family in prisons in England or Wales.
cy: Dyma'r ffordd gyflymaf a hawsaf i drefnu gweld ffrindiau a theulu sydd mewn carchar yng Nghymru a Lloegr.

source: Back to the service
cy: Yn ôl i'r gwasanaeth

source: Help with problems using this service:
cy: Cymorth gyda phroblemau wrth ddefnyddio'r gwasanaeth hwn:

source: Leave feedback or contact us at:
cy: Gadael adborth neu gysylltu â ni yn:

source: Book a social visit with a prisoner online using the ‘Visit someone in prison’ service:
cy: Trefnu ymweliad cymdeithasol gyda charcharor ar-lein gan ddefnyddio'r gwasanaeth 'Ymweld â rhywun yn y carchar'.

source: Back to the service:
cy: Yn ôl i'r gwasanaeth:

source: Dear sender,
cy: Annwyl anfonwr,

source: Your payment has been successful.
cy: Mae eich taliad wedi bod yn llwyddiannus.

source: Your confirmation number is <strong>%(short_payment_ref)s</strong>.
cy: Eich rhif cadarnhau yw <strong>%(short_payment_ref)s</strong>.

source: Money should reach the prisoner’s account in up to 3 working days.
cy: Dylai'r arian gyrraedd cyfrif y carcharor mewn hyd at 3 diwrnod gwaith.

source: Payment to:
cy: Taliad at:

source: Amount paid:
cy: Swm a dalwyd:

source: Date payment made:
cy: Dyddiad gwneud y taliad:

source: Thank you for using this service.
cy: Diolch yn fawr i chi am ddefnyddio'r gwasanaeth hwn.

source: Your confirmation number is %(short_payment_ref)s.
cy: Eich rhif cadarnhau yw %(short_payment_ref)s.

source: Amount paid
cy: Swm a dalwyd

source: A bank transfer was returned or didn’t reach the prisoner
cy: Cafodd trosglwyddiad banc ei ddychwelyd neu ni wnaeth gyrraedd y carcharor

source: If your bank transfer was returned
cy: Os cafodd eich trosglwyddiad banc ei ddychwelyd

source: The money sent to you was returned because you may have used an incorrect reference.
cy: Cafodd yr arian a anfonwyd atoch ei ddychwelyd oherwydd efallai eich bod wedi defnyddio cyfeirnod anghywir.

source: If so, you’ll get a refund within 4 working days of making the bank transfer.
cy: Os felly, cewch ad-daliad o fewn 4 diwrnod gwaith o wneud y trosglwyddiad banc.

source: Your bank statement will show ‘GBS RE NOMS AGENCY’ and the reference will be ‘REFUND’.
cy: Bydd ‘GBS RE NOMS AGENCY’ yn ymddangos ar eich cyfriflen banc a'r cyfeirnod fydd ‘REFUND’.

source: No money will reach the prisoner.
cy: Ni fydd arian yn cyrraedd y carcharor.

source: If your bank transfer didn’t reach the prisoner
cy: Os na gyrhaeddodd eich trosglwyddiad banc y carcharor

source: It could be because you made a transfer at a bank branch or from an international bank account.
cy: Fe allai hyn fod oherwydd eich bod wedi gwneud trosglwyddiad mewn banc neu o gyfrif banc rhyngwladol.

source: If you do this, your payment won’t go through.
cy: Os byddwch yn gwneud hyn, ni fydd eich taliad yn cael ei brosesu.

source: That means we can’t credit the prisoner and you’ll have to request a refund.
cy: Golyga hyn nad ydym yn gallu credydu'r carcharor a bydd rhaid i chi ofyn am ad-daliad.

source: To request a refund, <a href="%(contact_url)s">find the prison address</a> and write to the prison.
cy: I ofyn am ad-daliad, <a href="%(contact_url)s">chwiliwch am gyfeiriad y carchar</a> ac ysgrifennwch i'r carchar.

source: Address your letter to the ‘Business Hub’ and confirm:
cy: Cyfeiriwch eich llythyr i'r 'Ganolfan Fusnes' a chadarnhewch:

source: your name
cy: eich enw

source: your address
cy: eich cyfeiriad

source: the prisoner’s name
cy: enw'r carcharor

source: the prisoner number
cy: rhif y carcharor

source: the amount and date you paid
cy: y swm a'r dyddiad wnaethoch dalu

source: the bank branch where you made the payment
cy: y gangen lle gwnaethoch y taliad

source: The prison will send you a refund by cheque.
cy: Bydd y carchar yn anfon ad-daliad atoch ar ffurf siec.

source: If this doesn’t help, please <a href="%(feedback_url)s">contact us</a>.
cy: Os nad yw hyn yn helpu, <a href="%(feedback_url)s">cysylltwch â ni</a>.

source: A payment has taken longer
cy: Mae taliad wedi cymryd mwy o amser

source: In almost all cases, the payment reaches the prisoner’s bank account in up to 3 days.
cy: Mewn bron pob achos, bydd y taliad yn cyrraedd cyfrif banc y carcharor o fewn hyd at 3 diwrnod.

source: However, if it seems to be taking longer, it could be because an individual prison has put a payment on hold or the money could be in the prisoner’s account but the prisoner doesn’t know about it yet.
cy: Fodd bynnag, os yw'n cymryd mwy na hyn, efallai bod carchar penodol yn dal taliad yn ôl neu fe allai'r arian fod yng nghyfrif y carcharor ond nid yw'r carcharor yn gwybod amdano eto.

source: If you’re still worried after 7-10 days, please <a href="%(contact_url)s">contact the prison</a>.
cy: Os ydych dal i boeni ar ôl 7-10 diwrnod, <a href="%(contact_url)s">cysylltwch â'r carchar</a>.

source: Payment issues
cy: Problemau talu

source: If you’ve already sent money but are experiencing problems, we can help.
cy: Os ydych eisoes wedi anfon arian ond eich bod yn cael problemau, yna gallwn helpu.

source: Find out:
cy: Darganfod:

source: why a <a href="%(help_page_url)s">bank transfer didn’t reach the prisoner</a> or was returned
cy: pam cafodd <a href="%(help_page_url)s">trosglwyddiad banc</a> ei ddychwelyd neu pam na wnaeth gyrraedd y carcharor

source: why a <a href="%(help_page_url)s">payment has taken longer</a>
cy: pam fod <a href="%(help_page_url)s">taliad wedi cymryd mwy o amser</a>

source: what happens to money sent when a <a href="%(help_page_url)s">prisoner has been moved or released</a>
cy: beth sy'n digwydd i arian sydd wedi'i anfon pan fydd <a href="%(help_page_url)s">carcharor wedi cael ei symud neu ei ryddhau</a>

source: If none of the above help to solve your problem, please <a href="%(feedback_url)s">contact us</a>.
cy: Os nad yw unrhyw un o'r uchod yn helpu i ddatrys eich problem, yna <a href="%(feedback_url)s">cysylltwch â ni</a>.

source: A prisoner has been moved or released
cy: Mae carcharor wedi cael ei symud neu ryddhau

source: If the prisoner has been:
cy: Os yw'r carcharor wedi cael ei:

source: moved, the money will be transferred to the next prison, whether it’s a public or private prison – if it’s a <a href="%(private_prisons_url)s">private prison</a> the process may take longer
cy: symud, bydd yr arian yn cael ei drosglwyddo i'r carchar nesaf, pa un a yw'n garchar cyhoeddus neu breifat – os ydyw'n <a href="%(private_prisons_url)s">garchar preifat</a> efallai y bydd y broses yn cymryd mwy o amser

source: released, they need to <a href="%(contact_url)s">contact the prison</a> and ask the prison to send them the money
cy: rhyddhau, bydd angen iddynt <a href="%(contact_url)s">gysylltu â'r carchar</a> a gofyn i'r carchar anfon yr arian atynt

source: Day
cy: Diwrnod

source: Month
cy: Mis
