Repository: ministryofjustice/money-to-prisoners-send-money
Catalog: mtp_send_money/translations/*/LC_MESSAGES/django.po
Languages: cy

source: Year
cy: Blwyddyn

source: How do you want to send money?
cy: Sut ydych chi eisiau anfon arian?

source: Sending money by debit card is temporarily unavailable
cy: Ni allwch anfon arian gyda cherdyn debyd ar hyn o bryd

source: You can come back later or choose to get a prisoner reference to use in a UK bank transfer
cy: Gallwch ddod yn ôl wedyn neu ddewis creu cyfeirnod carcharor i'w ddefnyddio wrth wneud trosglwyddiad banc DU

source: Paying by debit card won’t work because we don’t support your device or browser
cy: Ni fydd talu â cherdyn debyd yn gweithio oherwydd nid ydym yn cefnogi eich dyfais neu borwr

source: Try another computer or a newer browser, for example, Chrome, Firefox or Internet Explorer 11 and up
cy: Defnyddiwch gyfrifiadur arall neu borwr fwy newydd, er enghraifft Chrome, Firefox neu Internet Explorer 11

source: or
cy: neu

source: Which is right for me?
cy: Pa un yw'r opsiwn gorau i mi?

source: Temporarily unavailable
cy: Ddim ar gael ar hyn o bryd

source: You can complete your payment here using Mastercard/Visa debit cards
cy: Gallwch gwblhau eich taliad yma gan ddefnyddio cardiau debyd Mastercard/Visa

source: The money should take up to 3 working days to reach the prisoner’s account
cy: Dylai'r arian gymryd hyd at 3 diwrnod gwaith i gyrraedd cyfrif y carcharor

source: You’ll get email confirmation of payment
cy: Fe gewch e-bost i gadarnhau'r taliad

source: You can make an international payment using a debit card
cy: Gallwch wneud taliad rhyngwladol gan ddefnyddio cerdyn debyd

source: You’ll get a prisoner reference you can use to make a bank transfer using online banking, your mobile banking app or telephone banking
cy: Fe gewch gyfeirnod carcharor y gallwch ei ddefnyddio i wneud trosglwyddiad banc gan ddefnyddio bancio ar-lein, eich ap bancio symudol neu wasanaeth bancio dros y ffôn

source: You can re-use this reference for this prisoner each time you make a transfer
cy: Gallwch ailddefnyddio'r cyfeirnod hwn ar gyfer y carcharor hwn bob tro y byddwch yn gwneud trosglwyddiad

source: You don’t get email confirmation after your bank transfer
cy: Ni fyddwch yn cael ebost i gadarnhau eich trosglwyddiad banc

source: Continue
cy: Parhau

source: Public prisons in England and Wales
cy: Carchardai cyhoeddus yng Nghymru a Lloegr

source: The ‘Send money to a prisoner’ service is available in the following public prisons, young offender institutions and immigration removal centres in England and Wales.
cy: Mae'r gwasanaeth 'Anfon arian at garcharor' ar gael yn y carchardai cyhoeddus, sefydliadau troseddwyr ifanc a chanolfannau symud mewnfudwyr canlynol yng Nghymru a Lloegr.

source: Search
cy: Chwilio

source: No prisons found
cy: Ni chanfuwyd unrhyw garchardai

source: There was a problem
cy: Roedd yna broblem

source: Please check:
cy: Gwiriwch:

source: you entered the details correctly
cy: eich bod wedi nodi'r manylion yn gywir

source: you’re sending money to a <a href="%(prison_list_url)s">public prison</a>
cy: eich bod yn anfon arian i <a href="%(prison_list_url)s">garchar cyhoeddus</a>

source: the details match those held by the prison - ask the prisoner to check with the wing officer
cy: bod y manylion yn cyfateb i'r manylion a gedwir gan y carchar - gofynnwch i'r carcharor eu gwirio gyda swyddog yr adain

source: Terms and conditions and privacy policy
cy: Telerau ac amodau a pholisi preifatrwydd

source: By using the send money to a prisoner service using your bank account you agree to our privacy policy and to these terms and conditions.
cy: Drwy ddefnyddio'r gwasanaeth anfon arian at garcharor gan ddefnyddio eich cyfrif banc rydych yn cytuno i'n polisi preifatrwydd ac i'r telerau ac amodau hyn.

source: Please read them carefully.
cy: Darllenwch nhw'n ofalus.

source: General
cy: Cyffredinol

source: These terms and conditions affect your rights and liabilities under the law.
cy: Mae’r telerau ac amodau hyn yn effeithio ar eich hawliau a’ch rhwymedigaethau dan y gyfraith.

source: They govern your use of, and relationship with, the send money to a prisoner service and information about sending money to prisoners using your bank account.
cy: Maent yn rheoli’r defnydd a wnewch, a'ch perthynas gyda’r gwasanaeth anfon arian at garcharor a gwybodaeth am anfon arian at garcharorion gan ddefnyddio eich cyfrif banc.

source: They don’t apply to other services provided by the Ministry of Justice (HM Prison Service), or to any other department or service which is linked to in this service.
cy: Nid ydynt yn berthnasol i wasanaethau eraill a ddarperir gan y Weinyddiaeth Cyfiawnder (Gwasanaeth Carchardai EM), nac i unrhyw adran neu wasanaeth arall sy’n gysylltiedig â’r gwasanaeth hwn.

source: We may occasionally update these terms and conditions.
cy: Mae'n bosib y byddwn o bryd i'w gilydd yn diweddaru'r telerau ac amodau hyn.

source: This might happen if there’s a change in the law or to the way this service works.
cy: Gall hyn ddigwydd os bydd newid yn y gyfraith neu i'r ffordd y mae'r gwasanaeth hwn yn gweithio.

source: We recommend you check this page regularly for any updates.
cy: Rydym yn argymell eich bod yn gwirio'r dudalen hon yn rheolaidd am unrhyw ddiweddariadau.

source: If you don’t agree to the terms and conditions and privacy policy set out in this document, you should not send money to prisoners using your bank account.
cy: Os nad ydych yn cytuno â’r telerau ac amodau a’r polisi preifatrwydd sydd yn y ddogfen hon, ni ddylech anfon arian at garcharorion gan ddefnyddio eich cyfrif banc.

source: Applicable law
cy: Y gyfraith sy’n berthnasol

source: Your use of this service and any dispute arising from its use will be governed by and construed in accordance with the laws of England and Wales, including but not limited to the:
cy: Bydd y defnydd a wnewch o’r gwasanaeth hwn ac unrhyw anghydfod sy’n codi o’i ddefnyddio yn cael ei reoli a’i ddehongli yn unol â chyfreithiau Cymru a Lloegr, yn cynnwys ond ddim yn gyfyngedig i:

source: How to use this service responsibly
cy: Sut i ddefnyddio'r gwasanaeth hwn yn gyfrifol

source: There are risks in using a shared computer, such as in an internet café, to use this service.
cy: Mae peryglon defnyddio cyfrifiadur sy'n cael ei rannu, megis mewn caffi rhyngrwyd, i ddefnyddio'r gwasanaeth hwn.

source: It’s your responsibility to be aware of these risks and to avoid using any computer which may leave your personal information accessible to others.
cy: Eich cyfrifoldeb chi yw bod yn ymwybodol o’r peryglon hyn ac osgoi defnyddio unrhyw gyfrifiadur lle mae posibilrwydd y gall eraill weld eich gwybodaeth bersonol.

source: You are responsible if you choose to leave a computer unprotected while in the process of sending money to a prisoner.
cy: Chi sy’n gyfrifol os ydych yn dewis gadael cyfrifiadur heb ei ddiogelu tra rydych yn y broses o anfon arian at garcharor.

source: We make every effort to check and test this service whenever we amend or update it.
cy: Byddwn yn gwneud popeth y gallwch i wirio a phrofi’r gwasanaeth hwn pryd bynnag y byddwn yn ei ddiwygio neu ei ddiweddaru.

source: However, you must take your own precautions to ensure that the way you access this service does not expose you to the risk of viruses, malicious computer code or other forms of interference which may damage your own computer system.
cy: Fodd bynnag, mae’n rhaid i chi gymryd gofal eich hunan i sicrhau nad yw’r ffordd yr ydych yn cael mynediad i'r gwasanaeth hwn yn eich gadael yn agored i’r perygl o feirysau, cod cyfrifiadur maleisus neu ymyrraeth o fath arall a allai achosi difrod i’ch system gyfrifiadurol eich hunan.

source: You must not misuse our service by knowingly introducing viruses, trojans, worms, logic bombs or other material which is malicious or technologically harmful.
cy: Ni ddylech gamddefnyddio ein gwasanaeth drwy gyflwyno’n fwriadol feirysau, ymwelwyr diwahoddiad, mwydod, bomiau rhesymeg neu unrhyw ddeunydd arall maleisus neu niweidiol i dechnoleg.

source: You must not attempt to gain unauthorised access to our service, the system on which our service is stored or any server, computer or database connected to our service. You must not attack our site via a denial-of-service attack or a distributed denial-of-service attack.
cy: Ni ddylech geisio cael mynediad heb awdurdod i'n gwasanaeth, y system lle caiff ein gwasanaeth ei storio nac unrhyw weinydd, cyfrifiadur neu gronfa ddata sy’n gysylltiedig â’n gwasanaeth. Ni ddylech ymosod ar ein gwefan drwy ymosodiad gwrthod gwasanaeth neu ymosodiad gwrthod gwasanaeth a ddosbarthwyd.

source: Privacy policy
cy: Polisi preifatrwydd

source: Information provided by this service
cy: Gwybodaeth a ddarperir gan y gwasanaeth hwn

source: We work hard to ensure that information about how to send money to a prisoner using your bank account is accurate.
cy: Rydym yn gweithio'n ddiwyd i sicrhau bod gwybodaeth am sut i anfon arian at garcharor gan ddefnyddio eich cyfrif banc yn gywir.

source: However, we can’t guarantee the accuracy and completeness of any information at all times.
cy: Fodd bynnag, ni allwn warantu bod unrhyw wybodaeth yn gywir ac yn gyflawn bob amser.

source: While we make every effort to ensure this service is accessible at all times, we are not liable if it is unavailable for any period of time.
cy: Er y gwnawn bob ymdrech i sicrhau mynediad at y gwasanaeth hwn bob amser, nid ydym yn atebol os nad yw ar gael am unrhyw gyfnod.

source: How we use your information
cy: Sut rydym yn defnyddio eich gwybodaeth

source: Sending money to a prisoner using your bank account:
cy: Anfon arian at garcharor gan ddefnyddio eich cyfrif banc:

source: We use your bank details and the payment reference number you provide to identify the payment sender, as well as the prisoner receiving money.
cy: Rydym yn defnyddio eich manylion banc a'r cyfeirnod talu y byddwch yn ei nodi i adnabod pwy sydd wedi anfon y taliad, yn ogystal â'r carcharor sy'n cael yr arian.

source: Money coming into the prison is monitored for the purposes of crime detection and prevention.
cy: Bydd arian sy'n dod i mewn i'r carchar yn cael ei fonitro er mwyn atal a datrys trosedd.

source: You have the right to request details as to the personal information we hold for you; and subsequently request that we correct any personal information if it is found to be inaccurate or out of date.
cy: Mae gennych hawl i ofyn am gael gweld manylion y wybodaeth bersonol a gedwir gennym amdanoch chi; ac wedyn cewch ofyn i ni gywiro unrhyw wybodaeth bersonol os yw’n anghywir neu’n hen.

source: To request your personal data please read the instructions in the <a href="%(url)s">Personal Information Charter</a>.
cy: I ofyn am eich data personol darllenwch y cyfarwyddiadau yn y <a href="%(url)s">Siarter Gwybodaeth Bersonol</a>.

source: You will need a <a href="%(url)s">Subject Access Request form</a>.
cy: Byddwch angen <a href="%(url)s">Ffurflen Gais Gwrthrych am Wybodaeth</a>.

source: We will not share your information with other organisations unless it is required for the purposes of prevention, detection of crime, apprehension, prosecution, and management of offenders; prevention of terrorism; national security; or required to by law.
cy: Ni fyddwn yn rhannu eich gwybodaeth gyda sefydliadau eraill oni bai fod hynny’n ofynnol er pwrpas atal a datrys trosedd, arestio, erlyn a rheoli troseddwyr; atal terfysgaeth; diogelwch cenedlaethol; neu os yw’n ofynnol o dan y gyfraith.

source: Separately from the information entered by those using this service, we also collect site-usage information which allows us to see how the service is being used in order to allow us to improve it.
cy: Ar wahân i’r wybodaeth y mae’r rhai sy’n defnyddio’r gwasanaeth wedi ei rhoi, rydym hefyd yn casglu gwybodaeth am ddefnydd o’r wefan sy’n ein galluogi i weld sut mae’r gwasanaeth yn cael ei ddefnyddio fel y gallwn ei wella.

source: This information does not contain any personal data, unless feedback is submitted with an email address.
cy: Nid yw'r wybodaeth hon yn cynnwys unrhyw ddata personol, oni bai bod adborth wedi'i gyflwyno gyda chyfeiriad e-bost.

source: It includes:
cy: Mae'n cynnwys:

source: questions, queries or feedback you leave, including your email address if you send a message via feedback
cy: cwestiynau, ymholiadau neu adborth rydych yn eu cyflwyno, gan gynnwys eich cyfeiriad e-bost os ydych yn anfon neges i roi adborth

source: your IP address, and details of which version of web browser you used
cy: eich cyfeiriad IP, a manylion ynghylch pa fersiwn o borwr gwe y gwnaethoch ei ddefnyddio

source: information on how you use the site, using cookies and page tagging techniques to help us improve the website
cy: gwybodaeth ynghylch sut rydych yn defnyddio’r wefan, gan ddefnyddio cwcis a thechnegau tagio tudalen i'n helpu i wella'r wefan

source: This helps us to:
cy: Mae hyn yn ein helpu i:

source: improve the site by monitoring how you use it
cy: Gwella’r wefan drwy fonitro sut rydych yn ei defnyddio

source: respond to any feedback you send us, if you’ve asked us to
cy: ymateb i unrhyw adborth rydych wedi’i anfon atom, os ydych wedi gofyn inni wneud hynny

source: provide you with information about local services if you want it
cy: rhoi gwybodaeth i chi am wasanaethau lleol os ydych eisiau hynny

source: We can’t personally identify you using your data.
cy: Ni allwn adnabod pwy ydych chi drwy ddefnyddio eich data.

source: Using other websites
cy: Defnyddio gwefannau eraill

source: These terms and conditions and privacy policy only cover the send money to a prisoner service and information about it.
cy: Mae'r telerau ac amodau hyn a'r polisi preifatrwydd yn berthnasol i'r gwasanaeth anfon arian at garcharor a gwybodaeth amdano yn unig.

source: They do not cover links from our website to other third party websites (including bank and building society websites) or any information collected by the parties who own and control those websites or their use of cookies.
cy: Nid ydynt yn berthnasol i ddolenni o'n gwefan ni i wefannau trydydd parti (gan gynnwys gwefannau banciau a chymdeithasau adeiladu) nac unrhyw wybodaeth a gasglwyd gan y partïon sy'n berchen ar, ac sy'n rheoli'r gwefannau hynny nac eu defnydd o gwcis.

source: Individual organisations operate their own policies regarding the use and sale of personal information and the use of cookies.
cy: Mae gan sefydliadau unigol eu polisïau eu hunain o ran defnyddio a gwerthu gwybodaeth bersonol a'u defnydd o gwcis.

source: When sending money to a prisoner using your bank account, we recommend that you refer to the specific terms and conditions and privacy policy of any banking website or service that you use.
cy: Pan fyddwch yn anfon arian at garcharor gan ddefnyddio eich cyfrif banc, rydym yn argymell eich bod yn cyfeirio at delerau ac amodau a pholisi preifatrwydd unrhyw wefan bancio neu wasanaeth y byddwch yn ei ddefnyddio.

source: Where your data is stored
cy: Ble mae eich data'n cael ei storio

source: We store your data on our secure servers in the EEA.
cy: Rydym yn storio eich data ar ein gweinyddion diogel yn yr Ardal Economaidd Ewropeaidd.

source: However, feedback may be stored outside of the EEA, where it could be viewed by our staff or suppliers.
cy: Fodd bynnag, gellir storio adborth y tu allan i'r Ardal Economaidd Ewropeaidd hefyd, lle y bydd ein staff neu ddarparwyr arbenigol yn gallu ei weld.

source: By submitting your personal data, you agree to this.
cy: Drwy gyflwyno eich data personol, rydych yn cytuno i hyn.

source: We also use other suppliers to provide this service:
cy: Rydym hefyd yn defnyddio cyflenwyr eraill i ddarparu'r gwasanaeth hwn:

source: <a href="%(url)s">Zendesk</a> to handle any feedback that you leave.
cy: <a href="%(url)s">Zendesk</a> i ymdrin ag unrhyw adborth y byddwch yn ei adael.

source: Any communication is deleted 2 weeks after the ticket is closed.
cy: Bu unrhyw gyfathrebiad yn cael ei ddileu 2 wythnos ar ôl i'r tocyn gael ei gau.

source: See the <a href="%(url)s">terms &amp; conditions</a> attached to this service.
cy: Gweler y <a href="%(url)s">telerau acamp; amodau</a> sydd ynghlwm â’r gwasanaeth hwn.

source: <a href="%(url)s">GOV.UK Pay</a> to handle any debit card payments you make.
cy: <a href="%(url)s">GOV.UK Pay</a> i ymdrin ag unrhyw daliadau cerdyn debyd y byddwch yn eu gwneud.

source: Keeping your data secure
cy: Cadw eich data'n ddiogel

source: Transmitting information over the internet is generally not completely secure, and we can’t guarantee the security of your data.
cy: Yn gyffredinol, nid yw trosglwyddo gwybodaeth dros y rhyngrwyd yn gwbl ddiogel, ac ni allwn warantu y bydd eich data’n ddiogel.

source: We do however use SSL in order to encrypt all data transferred to and received from our server.
cy: Fodd bynnag, rydym yn defnyddio SSL i amgryptio'r holl ddata sy'n cael ei drosglwyddo i'n gweinydd ac allan ohono.

source: SSL is an industry standard encryption of the communication between your browser and the server.
cy: Mae SSL yn wasanaeth amgryptio o safon ar gyfer y cyfathrebu sy'n digwydd rhwng eich porwr a'r gweinydd

source: We take data security very seriously and we take every step to ensure that your data remains private and secure.
cy: Rydym yn cymryd diogelu data o ddifrif ac yn cymryd pob cam posib i sicrhau bod eich data yn aros yn breifat a diogel.

source: Any data you transmit is at your own risk
cy: Byddwch yn trosglwyddo unrhyw ddata ar eich menter eich hun

source: We have procedures and security features in place to try and keep your data secure once we receive it.
cy: Mae gennym weithdrefnau a nodweddion diogelwch mewn lle i geisio cadw’ch data’n ddiogel ar ôl iddo ein cyrraedd.

source: We won’t share your information with any other organisations for marketing, market research or commercial purposes, and we don’t pass on your details to other websites.
cy: Ni fyddwn yn rhannu eich gwybodaeth ag unrhyw sefydliad arall at ddibenion marchnata, ymchwil i’r farchnad na masnachol, ac nid ydym yn anfon eich manylion ymlaen i wefannau eraill.

source: Disclosing your information
cy: Dadlennu eich gwybodaeth

source: We may pass on your personal information if we have a legal obligation to do so.
cy: Efallai y byddwn yn anfon eich gwybodaeth bersonol ymlaen os yw’n ddyletswydd gyfreithiol arnom i wneud hynny.

source: This service complies with all principles of the Data Protection Act 1998.
cy: Mae’r gwasanaeth hwn yn cydymffurfio â holl egwyddorion Deddf Diogelu Data 1998.

source: Ministry of Justice (MoJ) is the ‘data controller’ for the purposes of the Act.
cy: Y Weinyddiaeth Cyfiawnder (MoJ) yw’r 'rheolydd data' at ddibenion y Ddeddf.

source: However, the information you enter into this service is not automatically transmitted to the Ministry of Justice, but is stored in a secure database.
cy: Fodd bynnag, nid yw’r wybodaeth rydych yn ei chofnodi yn y gwasanaeth hwn yn cael ei throsglwyddo'n awtomatig i’r Weinyddiaeth Cyfiawnder, ond mae’n cael ei storio mewn cronfa ddata ddiogel.

source: No personal data will be used in testing this service.
cy: Ni ddefnyddir unrhyw ddata personol wrth brofi’r gwasanaeth hwn.

source: Our hosting provider, and MoJ staff responsible for supporting this service, will have access to the server in which all personal information entered into this service is stored.
cy: Bydd gan ein gwesteiwr, a staff y Weinyddiaeth Cyfiawnder sy’n gyfrifol am gefnogi’r gwasanaeth hwn, fynediad i'r gweinydd lle bydd yr holl wybodaeth bersonol a gofnodir yn y gwasanaeth hwn yn cael ei storio.

source: All staff who have access to the secure data have MoJ security clearance.
cy: Mae pob aelod o staff sydd â mynediad i'r data diogel wedi cael caniatâd gan y Weinyddiaeth Cyfiawnder.

source: Anyone who believes their personal data is kept within this service has the right to submit a subject access request to the MoJ, who will give details of the information stored on the server.
cy: Mae gan unrhyw un sy’n credu bod ei ddata personol yn cael ei gadw o fewn y gwasanaeth hwn yr hawl i gyflwyno cais gwrthrych am wybodaeth i’r Weinyddiaeth Cyfiawnder, a fydd yn rhoi manylion ynghylch yr wybodaeth sydd wedi’i storio ar y gweinydd.

source: Disclaimer
cy: Ymwrthodiad

source: We don’t accept liability for loss or damage incurred by users of this service, whether direct, indirect or consequential, whether caused by tort, breach of contract or otherwise.
cy: Nid ydym yn derbyn cyfrifoldeb am golled neu ddifrod sy’n dod i ran defnyddwyr y gwasanaeth hwn, naill ai’n uniongyrchol, yn anuniongyrchol neu’n ganlyniadol, pa un ai a yw’n cael ei achosi drwy gamwedd, tor-cytundeb neu fel arall.

source: This includes loss of income or revenue, business, profits or contracts, anticipated savings, data, goodwill, tangible property or wasted time in connection with this service or any websites linked to it and any materials posted on it.
cy: Mae hyn yn cynnwys colli incwm neu refeniw, busnes, elw neu gytundebau, arbedion a ragwelwyd, data, ewyllys da, eiddo diriaethol neu wastraff amser sy’n gysylltiedig â’r gwasanaeth hwn neu unrhyw wefannau sy’n gysylltiedig ag ef ac unrhyw ddeunydd sy’n cael ei bostio arno.

source: This condition shall not prevent claims for loss of or damage to your tangible property or any other claims for direct financial loss that are not excluded by any of the categories set out above.
cy: Ni fydd yr amod hwn yn atal hawliadau am golled neu ddifrod i’ch eiddo diriaethol nac unrhyw hawliadau eraill am golled ariannol uniongyrchol nad ydynt wedi’i heithrio gan unrhyw rai o’r categorïau uchod.

source: This does not affect our liability for death or personal injury arising from our negligence, nor our liability for fraudulent misrepresentation or misrepresentation as to a fundamental matter, nor any other liability which cannot be excluded or limited under applicable law.
cy: Nid yw hyn yn effeithio ar ein hatebolrwydd am farwolaeth neu anaf personol sy’n codi o’n hesgeuluster, nac ar ein hatebolrwydd am gamliwio twyllodrus neu gamliwio mewn perthynas â mater sylfaenol, nac unrhyw atebolrwydd arall na ellir ei eithrio neu ei gyfyngu dan y gyfraith berthnasol.
